Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Append Method
Overload List
Name | Description
Append(Arc)
 Appends an arc to the geometry list
Append(LineSegment)
 Appends a line segment to the geometry list
Append(Polycurve)
 Appends another polycurve to the geometry list
Top
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace